{
  "metadata": {
    "total_size": 10269854736
  },
  "weight_map": {
    "add_embedding.linear_1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "add_embedding.linear_1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "add_embedding.linear_2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "add_embedding.linear_2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "conv_in.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "conv_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "conv_norm_out.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "conv_norm_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "conv_out.bias": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "conv_out.weight": "diffusion_pytorch_model-00002-of-00002.safetensors",
    "down_blocks.0.downsamplers.0.conv.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.downsamplers.0.conv.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.conv1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.conv1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.conv2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.conv2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.time_emb_proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.0.time_emb_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.conv1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.conv1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.conv2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.conv2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.time_emb_proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.0.resnets.1.time_emb_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.norm.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.norm.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.proj_in.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.proj_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.proj_out.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.proj_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.0.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.0.transformer_blocks.1.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.norm.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.norm.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.proj_in.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.proj_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.proj_out.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.proj_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.0.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.attentions.1.transformer_blocks.1.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.downsamplers.0.conv.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.downsamplers.0.conv.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv_shortcut.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.conv_shortcut.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.time_emb_proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.0.time_emb_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.conv1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.conv1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.conv2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.conv2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.time_emb_proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.1.resnets.1.time_emb_proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.norm.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.norm.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.proj_in.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.proj_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.proj_out.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.proj_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.0.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.1.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.2.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.3.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.4.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.5.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.6.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.7.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.8.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.0.transformer_blocks.9.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.norm.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.norm.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.proj_in.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.proj_in.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.proj_out.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.proj_out.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.0.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm1.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm1.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm3.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.1.norm3.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.ff.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.ff.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.ff.net.2.bias": "diffusion_pytorch_model-00001-of-00002.safetensors",
    "down_blocks.2.attentions.1.transformer_blocks.2.ff.net.2.weight": "diffusion_pytorch_model-00001-of-00002.safetensors",
